#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=197aece9-ca97-4c12-b299-9a58f3ddf7c5]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bfe589e7-3732-4d61-aee0-a07a84189c09]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a1962625-0440-4341-a62a-5e9c2e6ad824]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=62eea72a-6b6e-4b01-961f-dc4ffdea4c87]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8407b7a5-b88c-4fd1-b965-047e91d9ff1d]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9df5f527-fa67-43db-b91d-944e536048e0]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e12c7cba-c159-4ff6-a1a5-7f9c51cc92b8]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a12e33b4-b32a-4620-9c05-0c9e82bfb029]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3204f3bb-b97f-4cf0-bd34-981b16e82061]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=863169a6-2a0b-4bf7-852c-1b6cbc602b85]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=86645255-9d6d-4c41-8afa-7e86a9466ef9]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=518d2b72-db37-4eec-988d-b152e0d0d7a6]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6ecffbc4-907e-4719-a080-6d13bfebd1a1]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=79bf113d-a17f-4129-97c5-75d5ca0bc3a1]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76d8c310-d0e6-4911-aea1-27d16cc282fe]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a9603c3a-f974-4167-a255-ee39e6272f66]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8010b3ec-b584-4825-8982-cf1241745500]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d8b1983e-0d63-4a47-a80b-f9b190afc0df]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=29cfd2d3-5191-4f18-b310-31ba3d1a1415]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa382880-a7c6-4f8d-ace8-62a6fa0af41b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=436f35e7-7a2a-46c6-871c-bbece3c0dc75]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=03dd9b32-22f7-4cbd-9ae9-e1190f470463]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd931d26-0b85-485a-8aab-734754b5a63b]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b073b2bb-8ea4-4cbd-8396-f7c04bf0a63d]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5fd64e8a-138c-409a-8adf-fb7ec3893b0a]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e14d93a8-5435-42c4-bc25-13804d761bc3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=49f8b227-6f1b-4cae-b3e4-1e8f6f3da8f2]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=deccc220-6355-4600-b148-dcb15f9c5c2a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a14066bd-dae6-47f2-a65a-67f18d584a72]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=38eb525a-5b43-4e7b-832d-4c477d6643cc]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=28cf3064-e729-4d9f-b23f-63b897bafdd3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e1bf4ca7-5104-46cf-bcab-faba874d6424]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=de4d3d8d-4c60-47a2-828c-224ce2191575]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1ae64cce-d62d-4c0f-9a99-ea8f3817b5ef]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=28e72bcf-3620-4f85-8ed5-22a5869668ae]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=15dc84b9-850c-456e-92d4-f306f0e11268]
module.keycloak_prod.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=31e895ea-60b3-480a-8e27-2b6d031f4c17]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d1ecd95e-f8f4-44b7-8188-dfce9342285b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=606e17b3-be4f-4cab-8a4d-b70d1a60d0b9]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=90139313-7f97-4621-abd4-d955e948b2e7]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4114113f-96a1-4ed1-a546-cb51030a9224]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6c19e3da-fbc5-4036-b152-0c25654d4907]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=83251981-5b8f-459f-b607-e41a589ea763]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=93490bf6-ac82-469c-b52e-85e046457093]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=949c4a17-105e-4c9b-ae5a-ed0b82fc294f]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d24fdc7b-8eac-4609-a1fc-268ad591bd3f]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=65874df5-8751-49f2-abc2-e261d86f6cb5]
module.keycloak_prod.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cec6cf0c-cfe3-4291-93af-3555a995b136]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1aa1cd7a-0f72-42f8-8b5c-3c83c0291c19]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=091da1a6-6014-41b4-98ee-c53dfdd246f7]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=42ed7ce9-97fd-41f5-b1a5-396aaa536b54]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aaf37759-2442-42dd-ab01-db572d096946]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2846153c-6f2a-4ddc-a7ea-0b9125e49b55]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6b09b865-d8b1-49c4-830f-3afc5bf696c9]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=57c1ee94-f80f-436f-9885-613c2ec968dc]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c4e64dfe-9cf3-41e0-807a-f33360e63bc9]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=053bb543-ddbe-446f-a2a8-9ec390a87737]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80231ac9-dfb3-40b4-a473-11f9730b9afe]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aea64389-3b68-45cb-bfa1-9d1676095e2c]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7e37c2e2-3f69-4d96-b762-3e2495f6a27b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=28b665cd-b95c-4388-9b3d-679ac825aaa2]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=eed7714f-26d0-4a58-a99a-fd9929499858]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5bc497f3-f26f-42a9-9a94-c67fbee2c888]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4c0be698-a63a-4250-a38b-43ff58d7c8da]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=296f3b69-e94b-49ac-ba67-16c86a6a6bfb]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96d101df-2c22-4eb6-a367-f89fbe7e2037]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4e7899c0-1fe9-48c7-ab88-7421b9407c68]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4de20fc-1333-4628-96f7-d919deb8eb01]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2b146397-e5e7-4fd3-b4bb-e429bcdd71b7]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fdea4659-f81b-4412-8790-d2a34fed0870]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=12cdc048-9154-496a-8771-6ce4b4da69a3]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47a05542-c70e-4a7b-a327-61a7967b241f]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=155959da-6fbe-47cf-87bb-4e3dda3c5f5b]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=83a79b0d-1adc-4a7e-a1d7-5b7514069d7f]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=548dd2de-3aba-490e-844e-74d70b0d330d]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d354c9f1-450b-44a5-ba23-83285dbe27b2]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8d52fb94-c091-4959-813e-8cddacafaa13]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ba02ab6f-67d0-4f1f-a809-1f9a2ff2cc71]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f4e10d15-e04e-4027-a75e-ce0212eab4a0]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=21f2f4c2-3cf9-4c5e-96e7-af6fb4ed98f1]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e2ff7649-8a81-47b9-a6f2-c4f6c5f15f83]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e16e4817-4390-440a-be44-8aae554c14df]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3972f8ee-e4f4-4415-a6eb-324ffbbaa3b7]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3f89b042-ccf7-40b8-8cd5-c6a362474135]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=40077f81-711d-4a09-904a-eae4bea03f44]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1478bee6-8cfd-4303-81b5-f71ea5d91689]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=345c4bbf-7092-4190-a322-26d18b831c16]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e5375a90-be56-4986-b3bb-e1977a0ad158]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a8c9c1fc-0707-4e7b-8757-6800ba9a3699]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "asdfasdfasdf-4"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "asdfasdfasdf-4"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "asdfasdfasdf-4"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdfasdfasdf-4"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*